#  casks
#tap 'caskroom/homebrew-cask' || true
cask_args appdir: '/Applications'

cask 'google-chrome'
cask 'flux'
cask 'steam'
cask 'spotify'
cask 'love'
cask 'vlc'
cask 'kitty'
cask 'skim'
cask 'docker'
cask 'miniconda'
cask 'google-cloud-sdk'

# fonts
tap 'homebrew/cask-fonts'
#cask 'font-dejavu'

# vcs
brew 'git'
brew 'git-lfs'

# Vis
brew 'graphicsmagick'
brew 'imagemagick'
brew 'graphviz'

# editor
#brew 'vim', args: ['--with-override-system-vi', '--with-client-server']
brew 'neovim'

# wm
tap 'koekeishiya/formulae'
brew 'yabai', restart_service: :changed
brew 'skhd', restart_service: :changed

# shell
brew 'zsh'
brew 'zsh-completions'
brew 'zoxide'

# python
brew 'flake8'
brew 'poetry'

# search
brew 'the_silver_searcher'
brew 'ripgrep'

# lua
brew 'lua-language-server'
brew 'lua@5.1'
brew 'luajit'
brew 'luarocks'

# build
brew 'gcc'
brew 'automake'
brew 'autoconf'
brew 'cmake'

# conf
brew 'libyaml'
brew 'yaml-cpp'

# numerics
brew 'gsl'

# utils
brew 'zip'
brew 'shellcheck'
brew 'eza'
brew 'htop'
brew 'pandoc'
brew 'cloc'
brew 'wget'
brew 'markdown'
brew 'pkg-config'
brew 'libarchive'
brew 'grip'
brew 'node'

# k8s
brew 'kubectl'
brew 'minikube'

# db
brew 'sqlite'

# dbt
tap 'dbt-labs/dbt'
brew 'dbt'

# auth
brew 'gpg'
brew 'pinentry-mac'
