#  casks
tap 'caskroom/homebrew-cask' || true
cask_args appdir: '/Applications'

cask 'google-chrome'
cask 'dropbox'
cask 'flux'
cask 'steam'
cask 'spotify'
cask 'love'
cask 'mactex'
cask 'macvim'
cask 'vlc'
cask 'xquartz'
cask 'kitty'
cask 'skim'

# vcs
brew 'git'
brew 'git-lfs'

# Vis
brew 'graphicsmagick'
brew 'imagemagick'
brew 'graphviz'

# editor
brew 'vim', args: ['--with-override-system-vi', '--with-client-server']

# wm
tap 'crisidev/homebrew-chunkwm'
tap 'koekeishiya/formulae'
brew 'chunkwm', restart_service: :changed
brew 'koekeishiya/formulae/skhd', restart_service: :changed

# shell
brew 'zsh'
brew 'zsh-completions'
brew 'z'

# python
brew 'flake8'

# search
brew 'the_silver_searcher'

# lua
brew 'lua@5.1'
brew 'luajit'

# C/C++/fortran
brew 'gcc'
brew 'boost'

# build
brew 'automake'
brew 'autoconf'
brew 'cmake'

# conf
brew 'libyaml'
brew 'yaml-cpp'

# numerics
brew 'gsl'

# utils
brew 'exa'
brew 'htop'
brew 'pandoc'
brew 'cloc'
brew 'wget'
brew 'markdown'
brew 'pkg-config'
brew 'libarchive'
brew 'grip'

# db
brew 'sqlite'
